#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.gh_log_cf: Reading...
module.fourkeys.data.archive_file.gh_log_cf: Read complete after 0s [id=74fd6f8c25441fd27e1bc4be4d2514868b7d7d7d]
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.google_storage_bucket.trigger-bucket: Refreshing state... [id=batch-gh-log-audit-source-bucket]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_storage_bucket.function_bucket: Refreshing state... [id=off-net-dev-function-source]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 0s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 0s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip: Refreshing state... [id=off-net-dev-function-source-src-47977897afcaa6e331c965854ad56cc8.zip]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 1s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_cloudfunctions2_function.batch_gh_audit_log_function: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/functions/batch_gh_audit_log]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloudfunctions2_function.batch_gh_audit_log_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions2_function" "batch_gh_audit_log_function" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/off-net-dev/locations/northamerica-northeast1/functions/batch_gh_audit_log" -> (known after apply)
      - labels           = {} -> null
      ~ name             = "batch_gh_audit_log" -> "cf-batch_gh_audit_log"
      ~ state            = "FAILED" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-02-27T15:58:03.034831598Z" -> (known after apply)
      ~ url              = "https://northamerica-northeast1-off-net-dev.cloudfunctions.net/batch_gh_audit_log" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/541105984323/locations/northamerica-northeast1/builds/24288da5-91ff-4f0c-bb28-cf097f14d11b" -> (known after apply)
          - docker_repository     = "projects/off-net-dev/locations/northamerica-northeast1/repositories/gcf-artifacts" -> null
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "off-net-dev-function-source" -> "off-net-dev-function-source-cf"
                  ~ generation = 1709049380699928 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY"
          + service_account_email = "dora-wif@off-net-dev.iam.gserviceaccount.com"
          + trigger               = (known after apply)
          + trigger_region        = "northamerica-northeast1"

          + event_filters {
              + attribute = "bucket"
              + value     = "batch-gh-log-audit-cf"
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "1024M"
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_INTERNAL_ONLY"
          + max_instance_count               = 3000
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 0
          + service                          = (known after apply)
          + service_account_email            = "dora-wif@off-net-dev.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # module.fourkeys.google_storage_bucket.function_bucket must be replaced
-/+ resource "google_storage_bucket" "function_bucket" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      ~ id                          = "off-net-dev-function-source" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "off-net-dev-function-source" -> "off-net-dev-function-source-cf" # forces replacement
      ~ project                     = "off-net-dev" -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/off-net-dev-function-source" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://off-net-dev-function-source" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.fourkeys.google_storage_bucket.trigger-bucket will be destroyed
  # (because google_storage_bucket.trigger-bucket is not in configuration)
  - resource "google_storage_bucket" "trigger-bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - force_destroy               = false -> null
      - id                          = "batch-gh-log-audit-source-bucket" -> null
      - labels                      = {} -> null
      - location                    = "NORTHAMERICA-NORTHEAST1" -> null
      - name                        = "batch-gh-log-audit-source-bucket" -> null
      - project                     = "off-net-dev" -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/batch-gh-log-audit-source-bucket" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://batch-gh-log-audit-source-bucket" -> null
    }

  # module.fourkeys.google_storage_bucket.trigger_bucket_cf will be created
  + resource "google_storage_bucket" "trigger_bucket_cf" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST1"
      + name                        = "batch-gh-log-audit-cf"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip must be replaced
-/+ resource "google_storage_bucket_object" "load_gh_audit_log_zip" {
      ~ bucket           = "off-net-dev-function-source" -> "off-net-dev-function-source-cf" # forces replacement
      + content          = (sensitive value)
      ~ crc32c           = "fGjEmw==" -> (known after apply)
      ~ detect_md5hash   = "R5d4l6/KpuMxyWWFStVsyA==" -> "different hash"
      - event_based_hold = false -> null
      ~ id               = "off-net-dev-function-source-src-47977897afcaa6e331c965854ad56cc8.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "R5d4l6/KpuMxyWWFStVsyA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/off-net-dev-function-source/o/src-47977897afcaa6e331c965854ad56cc8.zip?generation=1709049380360896&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "src-47977897afcaa6e331c965854ad56cc8.zip"
      ~ output_name      = "src-47977897afcaa6e331c965854ad56cc8.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/off-net-dev-function-source/o/src-47977897afcaa6e331c965854ad56cc8.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*